tap "1password/tap", trusted: true
tap "gigalixir/brew", trusted: true
tap "heroku/brew", trusted: true
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew", trusted: true
tap "thoughtbot/formulae", trusted: true
tap "universal-ctags/universal-ctags", trusted: true
# Official Amazon AWS command-line interface
brew "awscli"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Command-line tools for fly.io services
brew "flyctl"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# YAML Parser
brew "libyaml"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# RC file (dotfile) management
brew "rcm"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# HTTP regression testing and benchmarking utility
brew "siege"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Convert HTML to PDF
brew "weasyprint"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Gigalixir CLI
brew "gigalixir/brew/gigalixir"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Command-line interface for 1Password
cask "1password-cli"
# Tools for building Android applications
cask "android-studio"
# All-in-one toolbox for developers
cask "devutils"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
npm "@rely-ai/caliber"
npm "caveman-shrink"
npm "typescript-language-server"
npm "typescript"
